[
    {
        "user": "U016535QCJ2",
        "type": "message",
        "ts": "1733705693.163279",
        "client_msg_id": "c4598388-38c7-442b-aa45-503fb4aaee69",
        "text": "Yeah, but it works. +7.4% POT after commission since July 1 on 950,000 bets. The log loss for my prices over the second half of every match since July 1 is better than that of the market (I did the analysis). It's amazing what you can do if you come up with something original :joy: And the passive bets also work in my favour (both in theory and so far in practice). Never been concerned about people with contrary opinions. The only one that counts is results over the life-time of what you are doing. Will be happy to assess my own efforts in another 5 years time. BTW, all I do is \"average\" out the probability of a player winning a match from that point in the match, using the starting price. It's a complicated average, based on a lot of data, but I don't even take into account who is playing. So I have better prices than the market, and I don't know who is playing. You can scoff all you like, but I think that's pretty cool :grin:",
        "team": "T4G9NBD2M",
        "user_team": "T4G9NBD2M",
        "source_team": "T4G9NBD2M",
        "user_profile": {
            "avatar_hash": "048f61bdc189",
            "image_72": "https:\/\/avatars.slack-edge.com\/2020-07-01\/1216267094995_048f61bdc189acecaafc_72.jpg",
            "first_name": "Misha",
            "real_name": "Misha Charrett",
            "display_name": "Misha",
            "team": "T4G9NBD2M",
            "name": "misha",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "thread_ts": "1722108321.629039",
        "parent_user_id": "U016535QCJ2",
        "blocks": [
            {
                "type": "rich_text",
                "block_id": "9Zs5P",
                "elements": [
                    {
                        "type": "rich_text_section",
                        "elements": [
                            {
                                "type": "text",
                                "text": "Yeah, but it works. +7.4% POT after commission since July 1 on 950,000 bets. The log loss for my prices over the second half of every match since July 1 is better than that of the market (I did the analysis). It's amazing what you can do if you come up with something original "
                            },
                            {
                                "type": "emoji",
                                "name": "joy",
                                "unicode": "1f602"
                            },
                            {
                                "type": "text",
                                "text": " And the passive bets also work in my favour (both in theory and so far in practice). Never been concerned about people with contrary opinions. The only one that counts is results over the life-time of what you are doing. Will be happy to assess my own efforts in another 5 years time. BTW, all I do is \"average\" out the probability of a player winning a match from that point in the match, using the starting price. It's a complicated average, based on a lot of data, but I don't even take into account who is playing. So I have better prices than the market, and I don't know who is playing. You can scoff all you like, but I think that's pretty cool "
                            },
                            {
                                "type": "emoji",
                                "name": "grin",
                                "unicode": "1f601"
                            }
                        ]
                    }
                ]
            }
        ]
    }
]